add the additional information for documentations
